{"pageProps":{"tiers":[{"tier":"Trial","name":"90-day Trial","price":0,"isFree":true,"isStartingPrice":false,"description":"Learn about the iTwin Platform at your own pace.\n\n#### **Access all iTwin Platform services**\n\n#### **Includes 1 GB of cloud data and 50GB of reality data storage \\*\\***\n\n#### **Community Support**\n"},{"tier":"Basic","name":"Basic","price":500,"isFree":false,"isStartingPrice":true,"description":"Perfect for those building their first application and introducing it to market.\n\n#### **Access all iTwin Platform services**\n\n#### **Includes 250 GB of cloud data and 50GB of reality data storage \\*\\***\n\n#### **Community Support**\n\n#### **Invoiced Monthly**\n\n#### **$1.00 per credit**\n"},{"tier":"Premium","name":"Premium","price":1500,"isFree":false,"isStartingPrice":true,"description":"As your business grows, the iTwin Platform scales with you. Use more, pay less.\n\n#### **Access all iTwin Platform services**\n\n#### **Includes 1 TB of cloud data and 50GB of reality data storage \\*\\***\n\n#### **Premium Support**\n\n#### **Invoiced Monthly**\n\n#### **$0.90 per credit**\n"},{"tier":"Enterprise","name":"Enterprise","price":0,"isFree":false,"isStartingPrice":false,"description":"Build a plan customized for your design and commercial needs with flexible invoicing.\n\n#### **Access all iTwin Platform services**\n\n#### **Storage based on your needs**\n\n#### **Enterprise Support**\n\n#### **Flexible Invoicing Terms**\n\n#### **Pricing negotiable**\n"}],"preloadedApis":{"Data Management":[{"id":"/apis/edfs","description":"Enterprise Data Federation Service (EDFS or EDF) is a set of iTwin integration services designed to enable integration of Bentley iTwin platform solutions with any external enterprise system or user solutions (such as SAP®, IBM® Maximo™, Microsoft® SharePoint, ESRI, etc.). EDFS is the latest generation (6th) of BECS integration engine.\r\nEDFS is designed to support any requested integration by running any EDFS integration package from Bentley Integration Catalogue (BIC). Thanks to this flexibility and zero coding needed for design or maintenance of integration packages is easy to adapt any integration request.\r\nMain mission of EDFS is to provide zero coding, ready to use, Bentley catalogue based integration gateway to any user enterprise system or solution.","displayName":"Enterprise Data Federation Service (EDFS)","name":"edfs","path":"edfs","tags":["Data Management","Technology Preview"]},{"id":"/apis/grouping-and-mapping","description":"Reduce, categorize, and augment iModel data into optimized representations for consumption by downstream apps.","displayName":"Grouping and Mapping","name":"grouping-and-mapping","path":"grouping-and-mapping","tags":["Data Management","Technology Preview"]},{"id":"/apis/imodels-v2","description":"iModelHub is the control center for iModels. It is responsible for coordinating concurrent access to iModels as well as changes made to them in a form of [Changesets](https://www.itwinjs.org/learning/glossary/#changeset).\r\n\r\nOverview of [iModelHub](https://www.itwinjs.org/learning/imodelhub/) and [iModels](https://www.itwinjs.org/learning/imodels/).\r\n\r\nThese APIs lets you retrieve metadata about the iModels pushed to iModelHub. To view, create or update your iModels use [iTwin.js](https://www.itwinjs.org/) client libraries.\r\n","displayName":"iModels","name":"imodels-v2","path":"imodels","tags":["Data Management","General Availability"]},{"id":"/apis/library","description":"Digital Library to manage digital components\r\n\r\nDigital component library and catalog management service.  It allows users to efficiently manage and distribute their digital component libraries, providing their designers with approved, proprietary components as well as approved manufacturer's content. \r\n","displayName":"Library","name":"library","path":"library","tags":["Data Management","General Availability"]},{"id":"/apis/reality-data","description":"Interact with your reality data.\r\n\r\nView, update, create, and delete reality data.\r\n","displayName":"Reality Data","name":"reality-data","path":"realitydata","tags":["Data Management","Deprecated"]},{"id":"/apis/savedviews","description":"\r\nThe Saved Views API provides a central place to store view information so it can be retrieved or shared across applications.\r\n","displayName":"Saved Views","name":"savedviews","path":"savedviews","tags":["Data Management","General Availability"]},{"id":"/apis/sensor-data","description":"The Sensor Data Service (SDS) provides a unified method for publishing time series sensor data (and related metadata) within iTwin IoT. The SDS simplifies the process of connecting sensor data from sources including IoT Devices, IaaS IoT Hubs, Enterprise Systems, and other generic repositories. Availability of this data enables developers, vendors, and users to develop OT workflows to create new use cases for digital twins in their projects.\r\n","displayName":"Sensor Data","name":"sensor-data","path":"sensor-data","tags":["Data Management","General Availability"]},{"id":"/apis/storage","description":"Storage API allowing quick files managing","displayName":"Storage","name":"storage","path":"storage","tags":["Data Management","General Availability"]}],"ITwinUnreal":[],"Reporting & Insights":[{"id":"/apis/carbon-calculation","description":"Access iTwin data integrations with Carbon Calculation solutions for Embodied Carbon, Life Cycle Assessments, and more.","displayName":"Carbon Calculation","name":"carbon-calculation","path":"insights/carbon-calculation","tags":["Reporting & Insights","Technology Preview"]},{"id":"/apis/imodels-odata","description":"Access iModels data using OData v4 interface","displayName":"iModels OData","name":"imodels-odata","path":"insights/imodels-odata","tags":["Deprecated","Reporting & Insights"]},{"id":"/apis/insights-v2","description":"Reporting is a resource for aggregating iTwin data to build custom dashboards and integrate iTwin data with your business applications.\r\n\r\n- Create digitial twin based reports which can be consumed through business intelligence applications such as Power BI.\r\n- Leverage the OData feed Data Access to generate reports by combining data from multiple data streams in the digital twin.","displayName":"Reporting","name":"insights-v2","path":"insights/reporting","tags":["Reporting & Insights","Technology Preview"]}],"Validation":[{"id":"/apis/clash-detection-v2","description":"The Clash Detection API allows you to manage clash detection suppression rules, tests, runs, results and manual suppression.","displayName":"Clash Detection","name":"clash-detection-v2","path":"clashdetection","tags":["Technology Preview","Validation"]}],"Synchronization":[{"id":"/apis/export","description":"Export API is a cloud-based API meant to export the data from the iModels to other standard formats such as IFC or LandXML. It allows users export data from iModels which are hosted in Bentley's iModelHub to an IFC or LandXML file.","displayName":"Export","name":"export","path":"export","tags":["General Availability","Synchronization"]},{"id":"/apis/mesh-export","description":"Export iModel 3D content to GLTF format.","displayName":"Mesh Export","name":"mesh-export","path":"mesh-export","tags":["Synchronization","Technology Preview"]},{"id":"/apis/pnid-to-itwin-v2","description":"Recognize symbols and tags from a raster PnID.","displayName":"PnID to iTwin","name":"pnid-to-itwin-v2","path":"synchronization/pnidtoitwin","tags":["General Availability","Synchronization"]},{"id":"/apis/synchronization","description":"iModel Connections API is a cloud-based synchronization API meant to synchronize the data in Input Files and iModels. It allows users to establish links from their design files to iModels, hosted in Bentley's iModelHub. Users can synchronize updates to their design files.","displayName":"Synchronization","name":"synchronization","path":"synchronization","tags":["General Availability","Synchronization"]},{"id":"/apis/transformations","description":"iModel transformations service\r\n\r\nPerform transformations on iModels.\r\n","displayName":"Transformations","name":"transformations","path":"transformations","tags":["General Availability","Synchronization"]}],"Project Delivery":[{"id":"/apis/changed-elements","description":"# Changed Elements\r\n\r\nThe Changed Elements API provides consumers with the elements that have changed in an iModel between two changesets. This API has four operations:\r\n\r\n1. Enable Change Tracking\r\n2. Get Change Tracking\r\n3. Get Comparison\r\n4. Get Changesets\r\n\r\nBefore obtaining a comparison, it is necessary to enable change tracking of an iModel. This means that the API will be listening to the following events:\r\n1. New Named Version Created\r\n2. Changeset Group Completed\r\n\r\nWhen any of those events trigger, the API will process the new changes and store a summary of all the elements that have changed.\r\n\r\nAfter tracking is enabled and the iModel is processed, the comparison endpoint may be used to query for a summary of changed elements between any two given `ChangeSets`.","displayName":"Changed Elements","name":"changed-elements","path":"changedelements","tags":["General Availability","Project Delivery"]},{"id":"/apis/forms","description":"Forms Service\r\n\r\nView, create, and edit details of forms that have been filled out for an iTwin/project, as well as their comments, attached files, and change history.  Full CRUD functionality is available for form data, with form definitions being available in a read-only context.\r\n\r\nNote that throughout this API the terms \"form\" (by itself) and \"form data\" both refer to the same thing: data collected from users (generally entered into controls of a UI, or programmatically generated). By contrast, a \"form definition\" is a piece of metadata connected to form data instances. It determines the \"type\" of form that is filled out, and in applications that support custom form layouts, it determines how the controls are placed in the user interface.\r\n\r\nForm definitions should be added, imported, and customized by project administrators through the Bentley Form Manager web application; they cannot be modified using this API. The app can be found at https://connect-formmanager.bentley.com/designer/#/your-itwin-id (replace `your-itwin-id` with the ID of the actual iTwin or project whose form definitions you want to customize).\r\n\r\n## Limits\r\n\r\nAll API calls that return a list of results will return a maximum of 50 results. Some endpoints support a `$top` parameter to specify a number of results to retrieve (up to the maximum) and a `continuationToken` parameter to continue paging through results, allowing access to results beyond the first 50. These parameters will be included in the documentation for those endpoints.\r\n\r\nClients with a Developer, Partner, or Integrator subscription will be limited to 5000 requests per minute. Clients with a Trial subscription will be limited to 500 requests per minute.","displayName":"Forms","name":"forms","path":"forms","tags":["General Availability","Project Delivery"]},{"id":"/apis/issues-v1","description":"Issue Service\r\n\r\nView, create, and edit details of issues that have been raised in an iTwin or project, as well as their comments, attached files, and change history.  Retrieval of form definitions (which define how to display an issue in an interactive UI) is also supported, though customization of them is not, and should be done by a project administrator through the CONNECT Issues web application, if needed. This form-editing app can be found at https://connect-formmanager.bentley.com/designer/#/your-itwin-id where `your-itwin-id` is replaced by the ID of the iTwin or project you're creating custom forms for.\r\n\r\n## Limits\r\n\r\nAll API calls that return a list of results will return a maximum of 50 results. Some endpoints support a `$top` parameter to specify a number of results to retrieve (up to the maximum) and a `continuationToken` parameter to continue paging through results, allowing access to results beyond the first 50. These parameters will be included in the documentation for those endpoints.\r\n\r\nClients with a Developer, Partner, or Integrator subscription will be limited to 5000 requests per minute. Clients with a Trial subscription will be limited to 500 requests per minute.","displayName":"Issues","name":"issues-v1","path":"issues","tags":["General Availability","Project Delivery"]}],"Reality Modeling":[{"id":"/apis/contextcapture","description":"Interact with your jobs and workspaces for Reality Modeling\r\n\r\nCreate, update, delete jobs and workspaces.","displayName":"Reality Modeling","name":"contextcapture","path":"contextcapture","tags":["General Availability","Reality Modeling"]},{"id":"/apis/realitydataanalysis","description":"Interact with your data analysis jobs.\r\n\r\nCreate, update, delete jobs.","displayName":"Reality Analysis","name":"realitydataanalysis","path":"realitydataanalysis","tags":["Reality Modeling","Technology Preview"]},{"id":"/apis/realityconversion","description":"Convert mentioned point cloud formats to web-friendly Orbit Point Cloud.","displayName":"Reality Conversion","name":"realityconversion","path":"realityconversion","tags":["Reality Modeling","Technology Preview"]},{"id":"/apis/reality-management","description":"Interact with your reality data.\r\n\r\nView, update, create, and delete reality data.\r\n","displayName":"Reality Management","name":"reality-management","path":"reality-management/reality-data","tags":["General Availability","Reality Modeling"]}],"Workflow Automation":[{"id":"/apis/webhooks-v2","description":"The Webhooks API allows you to subscribe to events happening in iTwin Platform.\r\n\r\n### Supported event sources\r\n\r\n- iModels events\r\n","displayName":"Webhooks","name":"webhooks-v2","path":"webhooks","tags":["General Availability","Workflow Automation"]}],"Administration":[{"id":"/apis/access-control-v2","description":"Manage Access Controls for your iTwin member using iTwin roles and permissions.","displayName":"Access Control","name":"access-control-v2","path":"accesscontrol","tags":["Administration","General Availability"]},{"id":"/apis/itwins","description":"Interact with your iTwins.","displayName":"iTwins","name":"itwins","path":"itwins","tags":["Administration","General Availability"]},{"id":"/apis/users","description":"Access information about users.\r\n","displayName":"Users","name":"users","path":"users","tags":["Administration","General Availability"]}],"Events":[],"Visualization":[{"name":"visualization","path":"visualization","displayName":"Visualization","tags":[]}]},"usingCreditsMdContent":"### Why iTwin Platform credits?\n\niTwin Platform credits provide you with the flexibility to start your project small and grow it along with your business. Credits allow you to pay for the usage of any iTwin Platform service removing the overhead of setting up separate subscriptions for each service.\n","faqMdContent":"**When do I need a paid subscription?**<br>\nYou need a paid subscription when you want to exceed the usage limits of the Trial. You also need a paid subscription for any application you want to use in production.\n\n**How many apps and end users can I have?**<br>\nThere is no limit to the number of applications you can register or the number of end users for your applications.\n\n**Does my iTwin Platform subscription auto-renew?**<br>\nYes, the subscription will automatically renew based on your invoicing period. Please see your subscription agreement for details on cancelling your subscription.\n\n**What happens if I exceed my monthly credit allocation?**<br>\nNot to worry, you will still be able to access the iTwin Platform services even if you exceed your monthly credit allocation (and you won't get a surprise bill in the mail for the additional usage). We will contact you to discuss future usage and ensure you have a subscription that is aligned with your evolving needs.\n\n**What happens if I do not use all the iTwin Platform credits in my monthly subscription?**<br>\nThe iTwin Platform credits do not roll over at this time and any unused credits will no longer be available. If you have a balance left at the end of each month, we can work with you to find a subscription that better suits your needs.\n\n**What does premium / enterprise support mean?**<br>\nPremium and enterprise support are provided to help you scale your business. Premium support includes access to our Developer Success team who can assist with design sessions and architectural reviews to help you optimize your use of the iTwin Platform. Enterprise support adds to premium support and includes a dedicated Development Success Manager and hackathons.\n\n**Can I use iTwin Platform credits to pay for other Bentley software and services?**<br>\nNo, not at this time.\n\n**What happens if I use a partial credit?**<br>\nAt the end of each invoicing period, your total iTwin Platform credit usage (for all applications registered under your subscription) will be totaled and rounded up to a whole credit. In the case that you have a total that includes a partial credit (for example 1,983.45 credits) we will round up to the nearest credit (for example 1,984 credits).\n\n**How is file storage consumption calculated?**<br>\nConsumption of file storage for the Storage and Reality Management APIs is based on the peak usage for the month. Your consumption value may not be reflected accurately when running reports for a partial month.\n","contactUsMdContent":"### Not sure how many credits you need?\n\nWe understand it can be hard to estimate how many iTwin Platform credits you will need as you are getting started. We can assist you in estimating your iTwin Platform credit usage or answering any questions you may have. Click **Contact us**, fill out the contact form and we'll be happy to help.\n"},"__N_SSG":true}