{"pageProps":{"agreement":"<!DOCTYPE  html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\">\r\n<html xmlns=\"http://www.w3.org/1999/xhtml\" xml:lang=\"en\" lang=\"en\"><head><meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\"/><title>file_1652094850385</title><meta name=\"author\" content=\"tanisha.brown\"/><style type=\"text/css\"> * {margin:0; padding:0; text-indent:0; }\r\n .s1 { color: #212121; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: bold; text-decoration: none; font-size: 12pt; }\r\n p { color: black; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: normal; text-decoration: none; font-size: 10pt; margin:0pt; }\r\n .s2 { color: #212121; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: bold; text-decoration: none; font-size: 10pt; }\r\n .s4 { color: #1F8BE6; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: normal; text-decoration: none; font-size: 10pt; }\r\n .s5 { color: #002A43; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: normal; text-decoration: underline; font-size: 10pt; }\r\n .s6 { color: black; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: normal; text-decoration: none; font-size: 10pt; }\r\n li {display: block; }\r\n #l1 {padding-left: 0pt;counter-reset: c1 1; }\r\n #l1> li>*:first-child:before {counter-increment: c1; content: counter(c1, decimal) \". \"; color: black; font-style: normal; font-weight: normal; text-decoration: none; }\r\n #l1> li:first-child>*:first-child:before {counter-increment: c1 0;  }\r\n #l2 {padding-left: 0pt;counter-reset: c2 1; }\r\n #l2> li>*:first-child:before {counter-increment: c2; content: counter(c2, upper-latin) \". \"; color: black; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: normal; text-decoration: none; font-size: 10pt; }\r\n #l2> li:first-child>*:first-child:before {counter-increment: c2 0;  }\r\n #l3 {padding-left: 0pt;counter-reset: c2 1; }\r\n #l3> li>*:first-child:before {counter-increment: c2; content: counter(c2, upper-latin) \". \"; color: black; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: normal; text-decoration: none; font-size: 10pt; }\r\n #l3> li:first-child>*:first-child:before {counter-increment: c2 0;  }\r\n #l4 {padding-left: 0pt;counter-reset: d1 1; }\r\n #l4> li>*:first-child:before {counter-increment: d1; content: \"(\" counter(d1, lower-latin) \") \"; color: black; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: normal; text-decoration: none; font-size: 10pt; }\r\n #l4> li:first-child>*:first-child:before {counter-increment: d1 0;  }\r\n #l5 {padding-left: 0pt;counter-reset: e1 1; }\r\n #l5> li>*:first-child:before {counter-increment: e1; content: \"(\" counter(e1, lower-latin) \") \"; color: black; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: normal; text-decoration: none; font-size: 10pt; }\r\n #l5> li:first-child>*:first-child:before {counter-increment: e1 0;  }\r\n #l6 {padding-left: 0pt;counter-reset: c2 1; }\r\n #l6> li>*:first-child:before {counter-increment: c2; content: counter(c2, upper-latin) \". \"; color: black; font-family:\"Calibri Light\", sans-serif; font-style: normal; font-weight: normal; text-decoration: none; font-size: 10pt; }\r\n #l6> li:first-child>*:first-child:before {counter-increment: c2 0;  }\r\n</style></head><body><p class=\"s1\" style=\"padding-top: 1pt;padding-left: 5pt;text-indent: 0pt;line-height: 15pt;text-align: left;\">Developer Terms of Service</p><p style=\"padding-left: 5pt;text-indent: 0pt;line-height: 12pt;text-align: left;\">Last Modified: April 4, 2022</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">IMPORTANT – READ CAREFULLY BEFORE ACCESSING OR USING THE SERVICES: These Developer Terms of Service</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">(“Terms”) represent a legal agreement between “you” (either an individual or single organization) and Bentley Systems, Incorporated, including any legal entity controlled by Bentley Systems, Incorporated (“Bentley”). These Terms govern your access to and use of the “iTwin Platform” defined in Section 1 of these Terms via Bentley’s iTwin Platform developer portal and any alternative and successive websites that Bentley may designate from time to time (the “Site”).</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">YOU AGREE TO BE BOUND BY THESE TERMS BY ACCESSING OR USING THE SERVICES. By accessing or using the Services (defined in Section 1. A.), you agree that you have read, understand and agree to be bound by and comply with these</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">(i) Terms, as amended from time to time, (ii) all guidelines, rules, policies, and terms and conditions applicable to the Services that may be posted by or on behalf of Bentley on the Site, in any technical or security requirements and documentation for the Services (“Documentation”) made available to you by Bentley or otherwise communicated by or on behalf of Bentley to you from time to time, (iii) as well as the Bentley Privacy Policy referenced in Section 3 of the Terms, all of which are hereby incorporated into these Terms (collectively, the “Additional Terms”).</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">If you are accessing or using the Services on behalf of an organization, you are agreeing to these Terms on behalf of that organization and undertaking that you have the authority to bind that organization to these Terms. YOUR ACCEPTANCE OF ALL OF THESE TERMS IS A CONDITION TO YOUR RIGHT TO ACCESS OR USE THE SERVICES. THESE TERMS REPRESENT THE ENTIRE SET OF TERMS AND CONDITIONS GOVERNING YOUR USE OF THE SERVICES AND SUPERSEDES ALL PRIOR OR CONTEMPORANEOUS ORAL OR WRITTEN COMMUNICATIONS, PROPOSALS AND</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">PRESENTATIONS WITH RESPECT TO THE SERVICES. If these Terms are translated into a language other than English and there is a conflict of terms between the English and the other language, the English version will control. If there is any conflict between these Terms and the Additional Terms, the Additional Terms will control.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">IF YOU DO NOT AGREE TO THESE TERMS, OR DO NOT HAVE THE REQUISITE AUTHORITY OR CAPACITY TO AGREE TO THESE TERMS, DO NOT ACCCESS THE SERVICES.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><ol id=\"l1\"><li data-list-text=\"1.\"><p style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify; font-weight: bold;\">Services.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><ol id=\"l2\"><li data-list-text=\"A.\"><p style=\"padding-left: 5pt;text-indent: 36pt;text-align: justify;\"><b>Grant.</b> Subject to these Terms and applicable usage rate limits and quotas, Bentley grants you a limited, non-transferable, non-exclusive right to access and use iTwin Platform Service APIs (Bentley’s platform as a service “PaaS” offering) and related Bentley content including documentation, sample code, tutorials, interfaces, tools, libraries, and scripts (“iTwin Platform Content”) that Bentley may make available (collectively the “Services”). You (including your part-time or full-time employees, or any temporary, term or contract professional or service personnel or employees whose work is supervised or managed by You and for whom you remain responsible (“Authorized Users”)), may access and use the Services for the sole purpose of developing, testing, integrating, operating, and supporting your applications. Unless specified otherwise in one or more other applicable agreements between you and Bentley, all Services are explicitly and exclusively for purposes directly related to your development of your own application(s) and are not to be used for any other commercial purpose. No other use of the Services provided under this Agreement is permitted without Bentley’s specific consent. Contact Bentley for the availability of alternate licensing and pricing if you desire to use the Services beyond the scope expressly permitted under the terms of this Agreement.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"B.\"><p style=\"padding-left: 5pt;text-indent: 36pt;text-align: justify;\"><b>Tech Preview Services.</b> From time-to-time Bentley may make available Services labeled “trial,” “trial tier,” “beta,” “tech preview,” “evaluation,” or similar designation (collectively, “Tech Preview Services”). Except as expressly set forth in the Additional Terms, any Tech Preview Services are expressly for non-production, non-commercial use and may be used solely for testing and evaluation purposes, and not for any other purpose from which you or others derive any material economic benefit (including competitive analysis). Tech Preview Services included in any Free Services are subject to all such non-production, non-commercial and other use restrictions. All</p><p style=\"padding-top: 2pt;padding-left: 5pt;text-indent: 0pt;text-align: justify;\">use of Tech Preview Services is subject to then-current applicable usage rate limits and quota limits as defined on the iTwin Platform Portal.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"C.\"><p style=\"padding-left: 5pt;text-indent: 36pt;text-align: justify;\"><b>Free Services.</b> From time-to-time Bentley may make available no charge Services labeled as “free,” or with some other similar designation (collectively, “Free Services”). Unless otherwise set forth on the offering, such Free Services may be used for production, commercial use, subject to then-current applicable usage rate limits and quota limits. Tech Preview Use included in any Free Services is subject to non-production, non-commercial, and other usage restrictions as outlined in section 1.3.B above.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li></ol></li><li data-list-text=\"2.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Modifications</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><ol id=\"l3\"><li data-list-text=\"A.\"><p style=\"padding-left: 5pt;text-indent: 36pt;text-align: justify;\"><b>Terms.</b> Bentley may update or amend these Terms at any time without notice to you by posting the amended terms on the Site. By continuing to access or use the Services after revisions have been posted on the Site and become effective, you agree to be bound by the revised Terms. If you do not agree to the new Terms, you must stop using the Services. The version of these Terms in effect at the time of your access or use of the Services will apply to such use or access.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"B.\"><p style=\"padding-left: 5pt;text-indent: 36pt;text-align: justify;\"><b>Services.</b> Bentley may improve, change, or discontinue the Services (including features, functions, operations, or APIs within a Service), from time to time. Bentley will control the format, content, delivery, and all other aspects of the Services, and reserves the right at any time to modify the information provided through the Services, discontinue, or terminate the Services, or any portion of the Services without providing you any prior notice. You are responsible to ensure that your access to and use of the Services is compatible with Bentley’s then-current requirements, including applicable usage rate limits and quotas.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"C.\"><p style=\"padding-left: 5pt;text-indent: 36pt;text-align: justify;\"><b>Services.</b> Free and Tech Preview Services may be terminated at any time by Bentley or by you, with or without cause, effective upon notice of termination. It is your responsibility to retain copies of your content or any third-party owned content you store in the Services. Bentley is not responsible for storing any of your content or data created, submitted, uploaded, or made available to Bentley in connection with the use of any Free or Tech Preview Services, and may delete any such content or data, and all backups thereof, at any time without notice. Bentley will not be liable for any loss or damage which may be incurred by you or any third parties because of the deletion of any of your content or data in connection with the use of any Free or Tech Preview Services.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li></ol></li><li data-list-text=\"3.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Acceptable Use</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You are solely responsible for your conduct, the content of your files and folders, and your communications with others while using the Services, and it is your responsibility to ensure that you have the rights or permission needed to comply with these Terms. The Services may include features that allow you to share your information with others or to make it public, whereby other users may copy, modify, or distribute your information. You, and not Bentley, are responsible for maintaining and protecting your information. Bentley will not be liable for any loss or corruption of your information, or for any costs or expenses associated with backing up or restoring any of your information.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\"><span style=\" color: #212121;\">You agree to use the Services only for lawful purposes. Specifically, </span>YOU HEREBY WARRANT AND REPRESENT THAT <u>YOU SHALL NOT USE THE SERVICES TO DO ANY OF THE FOLLOWING</u>:</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><ol id=\"l4\"><li data-list-text=\"(a)\"><p style=\"padding-top: 3pt;padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Upload, post or otherwise transmit: (i) any data or content that is unlawful, harmful, threatening, abusive, harassing, tortuous, defamatory, vulgar, obscene, libelous, invasive of another&#39;s privacy, hateful, or racially, ethnically or otherwise objectionable, (ii) any content that you do not have a right to transmit under any law or under contractual or fiduciary relationships (such as inside information, proprietary and confidential information learned or disclosed as part of employment relationships or under non-disclosure agreements), (iii) any content that infringes any patent, trademark, trade secret, copyright or other proprietary rights of any party, or (iv) any unsolicited or unauthorized advertising, promotional materials, &quot;junk mail,&quot; &quot;spam,&quot; &quot;chain letters,&quot; &quot;pyramid schemes,&quot; or any other form of solicitation, or altered, deceptive or false source-identifying information, including “spoofing” or “phishing”.</p></li><li data-list-text=\"(b)\"><p style=\"padding-top: 2pt;padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Intentionally or negligently upload, post, or otherwise transmit any material that contains software viruses, worms, Trojan horses, malware or any other computer code, files or programs designed to interrupt, destroy, or limit the functionality of any user, host, or network, computer software, hardware, or telecommunications equipment, for example, overloading, flooding, spamming, or mail-bombing any part of the Services.</p></li><li data-list-text=\"(c)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Intentionally or negligently interfere with or disrupt the Services or a network connected to the Services, or disobey any requirements, procedures, policies, or regulations of networks connected to the Services.</p></li><li data-list-text=\"(d)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Probe, scan, or test the vulnerability of any system or network, or breach or otherwise circumvent any security or authentication measures.</p></li><li data-list-text=\"(e)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Take any action that Bentley determines imposes an unreasonably or disproportionately large burden on Bentley&#39;s (or its designated third parties&#39;) infrastructure, including the Services.</p></li><li data-list-text=\"(f)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Attempt to bypass, delete, or manipulate any metering or technical limitations of the Services.</p></li><li data-list-text=\"(g)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Access, tamper with, or use non-public areas of the Services, shared areas of the Services you have not been invited to, or impersonate or misrepresent your affiliation with any person or entity.</p></li><li data-list-text=\"(h)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Access or search the Services by any means other than our publicly supported interfaces (for</p><p style=\"padding-left: 77pt;text-indent: 0pt;text-align: justify;\">example, “scraping” or any other automated process or means of access).</p></li><li data-list-text=\"(i)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Collect information about others without their consent.</p></li><li data-list-text=\"(j)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Engage in any other conduct that restricts or inhibits anyone’s use of the Services or which, as determined by Bentley, may harm Bentley or users of the Services, or expose them to liability.</p></li></ol><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You understand and acknowledge that you, not Bentley, must evaluate and bear all risks associated with content you use with the Service, and will be fully responsible and liable for what you copy, share, upload, download or otherwise use while using the Services, including without limitation its legality, reliability, or appropriateness. Bentley reserves the right, but does not assume any responsibility, to review and/or remove any material posted to the Services which Bentley, in its sole discretion, deems inconsistent with the foregoing commitments, including any material that Bentley has been notified, or has reason to believe, constitutes a copyright infringement, and to terminate any user’s access to all or part of the Services. However, Bentley assumes no liability for any action or inaction regarding transmissions, communications or content provided by third parties.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">Your failure to comply with these Acceptable Use provisions may result in termination of your access to the Services and may expose you to civil and/or criminal liability.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"4.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Privacy</p><p class=\"s4\" style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\"><a href=\"https://www.bentley.com/en/privacy-policy\" class=\"s6\" target=\"_blank\">Bentley’s use of the information, files, and folders that you submit to Bentley (together, “your information”) and your responsibilities  in  connection  with  protecting  your  privacy  are  described  in  Bentley’s  Privacy  Policy </a>https://www.bentley.com/en/privacy-policy <span style=\" color: #000;\">. By your use of the Services, you grant Bentley permission to interact with the content of your files and folders only to the limited extent necessary to perform operations selected by you including, but not limited to, viewing, securing and, searching the content.</span></p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You acknowledge and agree that Bentley may use third-party service providers in connection with the Services, including the use of cloud computing service providers which may transmit, maintain, and store your content and data using third-party computers and equipment in locations around the globe. You acknowledge and agree that any data storage functionality associated with the Services is not intended for the storage of any “Sensitive Personal Information” (social security numbers, credit or debit card numbers, financial account numbers, driver’s license numbers, medical information, health insurance information, sensitive data about personal characteristics such as race, religion, or sexual orientation, or other personal data that may pose a risk of harm to the individual if improperly disclosed or other personal information. You will not (and will not permit anyone else to) upload or otherwise submit any such information in connection with the Service. You also acknowledge and agree that Bentley will have no responsibility or liability with respect to any such information that may be processed, transmitted, disclosed, or stored in connection with the Service.</p><p style=\"padding-top: 2pt;padding-left: 5pt;text-indent: 0pt;text-align: justify;\">Your use of the Services may require or permit Bentley to collect or store your content or data. Bentley personnel will not access your content or data except (i) at your request, or with your consent (ii) in connection with providing and improving the Services (including maintaining, securing, updating, and modifying the Services), or (iii) in connection with legal obligations, investigations, or proceedings. By submitting, uploading, or displaying your content and data in or through the Service, you hereby grant to Bentley, for the sole purpose of providing and improving the Services (including maintaining, securing, updating and modifying the Services) or otherwise in accordance with these Terms, a worldwide, royalty-free, and non-exclusive license to access, use, reproduce, adapt, modify, publicly perform, publicly display, prepare derivative works of and distribute your content and data through the Service an aggregated and anonymized format, to improve the performance of our service as well as for development of new services. You represent and warrant to Bentley that you have all the rights, power, and authority necessary to grant the licenses and rights set forth in these Terms.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">If you delete content and data from the Services, you understand it may persist in backup and archival copies, and usage data may persist in metering systems and logs. Bentley has the right (but not the obligation) to delete inactive sites or accounts or purge related content without further notice.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"5.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Account Security</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">To access the Services, you will need to create a Bentley account and keep your account and contact information current. You may obtain and use client IDs, client secrets, and access tokens that are uniquely associated with your Bentley account or your applications (“Client Credentials”). You agree that you will not share (or permit anyone else to share) any user ID, passwords, or Client Credentials with anyone who is not an Authorized User, will not allow any third party (other than Authorized Users) to use or access your account, and will not do anything else that might jeopardize the security of your account. Please contact Bentley immediately if you suspect any unauthorized use of your Client Credentials or your account, or if any information about your account or Client Credentials has been lost or stolen. You are responsible for safeguarding the password, client secrets, API keys etc. that you use to access the Services and you agree not to disclose them to any third party. You are responsible for any activity using your account, whether you authorized that activity. You should immediately notify Bentley of any unauthorized use of your account. You acknowledge that if you wish to protect your transmission of data or files to Bentley, it is your responsibility to use a secure encrypted connection to communicate with the Services.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"6.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Client Software and Updates</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">Some use of the Services may require you to download a client software package (“Client Software”)., Bentley hereby grants you a limited, non-exclusive, non-transferable, revocable license to install and use the Client Software as a component of the Services. The Client Software may be used only by you and solely to access the Services. The Client Software is licensed, not sold, to you by Bentley, and is subject to these Terms. Your license to use the Client Software is automatically revoked if you violate these Terms in any manner. Bentley may facilitate your access to Client Software that is licensed under an open-source license, in such case, the terms of the applicable open-source license will be applicable to your access and use of such Client Software, and if there is a conflict between these Terms and the terms of the open-source license, the terms of the open-source license will prevail.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"7.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Permitted Use of Your Data</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You hereby agree and acknowledge that Bentley will from time-to-time collect metrics data relating to your installation, access or use of the Services (“Usage Data”) and that all Usage Data shall be owned by Bentley and deemed Bentley proprietary information. You hereby agree not to alter or interfere with the collection by Bentley of accurate Usage Data.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You hereby grant to Bentley a non-exclusive, perpetual, irrevocable and royalty-free license to use, reproduce, display, create derivative works from the Subscriber Data (defined below) in De-Identified Form (as defined below) for the purposes of developing, improving, optimizing, and delivering the iTwin Platform, including but not limited to developing and improving artificial intelligence and machine learning algorithms. The Subscriber Data will not be used for advertising or similar commercial purposes.</p><p style=\"padding-top: 2pt;padding-left: 5pt;text-indent: 0pt;text-align: justify;\">“Subscriber Data” means data collected and/or stored by Subscriber of the iTwin Platform, including, but not limited to, financial, business, and technical information, engineering plans, Subscriber and supplier information, research, designs, plans, and compilations, but not including any of Bentley’s Proprietary Information. “De-Identified Form” means data that is not in a form that could be used to identify Subscriber or any of Subscriber’s Users or customers.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"8.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Reservation of Rights</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">Neither these Terms nor your use of the Services or the Client Software grant you any right, title, or interest therein or to any information or material in the Services. The Services, Documentation and the Client Software are proprietary to Bentley and its affiliates or licensors and are protected by the laws of the United States and authorities based outside of the United States regarding copyrights, trademarks, trade secrets and other proprietary rights.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You are authorized to use the Services for legitimate business purposes. You may not copy, modify, create derivative works of, publicly display or perform, republish, store, transmit or distribute any of the Services without the prior written consent of Bentley.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You may not reverse engineer, decompile, disassemble, or otherwise reduce the Services to a human-perceivable form, determine or attempt to determine any source code, algorithms, methods, or techniques used or embodied in the Services, nor attempt to do so, nor assist anyone else to do so. You may not modify, network, rent, lease, loan, sublicense, broadcast, distribute or otherwise use the Services for commercial purposes. You may not remove, copy, sell or distribute any of the data or other content contained in the Services or use any portion thereof independent of the Services. .</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"9.\"><p style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\"><b>Confidential and Proprietary Information and Data.</b></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">For purposes of these Terms, “Confidential and Proprietary Information” shall include, but not be limited to, the Services and technical information relating to the Services which may, from time-to-time, be disclosed by Bentley to you under these Terms, including its functionality, performance, business purpose, specifications, documentation, and the like, including plans, business and financial information, and perhaps related software which is proprietary and confidential to Bentley or its licensors. It is understood by both parties that marketing materials that Bentley makes generally available to the public is proprietary to Bentley, but not confidential.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You may use Confidential and Proprietary Information only for the purposes permitted under these Terms. You shall make no other use of the Confidential and Proprietary Information, in whole or in part, without the specific prior written consent of Bentley. You shall maintain Bentley’s Confidential and Proprietary Information in strict confidence, and shall exercise the same degree of care in protecting Bentley’s Confidential and Proprietary Information as you exercise in protecting your own confidential and proprietary information.</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">Any other related materials supplied by Bentley, including Documentation, may not be reproduced in any manner by you. The original and all copies of Bentley’s Confidential and Proprietary Information shall remain the property of Bentley and shall be returned to Bentley upon demand.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You hereby acknowledge the following: (i) that irreparable injury and damage to Bentley will result from unauthorized disclosure of Bentley’s Confidential and Proprietary Information gleaned by you through use of the Services, and from use of the Services other than as contemplated herein; (ii) Monetary damages may not be sufficient remedy for unauthorized disclosure of Bentley’s Confidential and Proprietary Information; (iii) Bentley shall be entitled, without waiving any additional rights or remedies available to it at law, in equity, or by statute, to such injunctive or equitable relief as may be deemed proper by a court of competent jurisdiction; (iv) and your breach of the Terms shall result in immediate termination of these Terms and may be cause for exclusion from other Bentley sponsored programs, among other remedies available to Bentley at law.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"10.\"><p style=\"padding-left: 41pt;text-indent: -36pt;line-height: 12pt;text-align: justify;\"><b>Feedback, Submissions and Comments</b></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">During your use of the Services, Bentley may solicit your opinion and evaluation of the Services. You agree that right, title and interest to any reports, feedback or suggestions relating to your opinions and evaluation of the Services or any inventions relating to an improvement, modification or enhancement of the Services conceived in, or made as a result of your providing Bentley such reports, feedback or suggestions shall become the exclusive property of Bentley</p><p style=\"padding-top: 2pt;padding-left: 5pt;text-indent: 0pt;text-align: justify;\">and that Bentley may disclose and use such information for any purposes whatsoever, entirely without obligation of any kind to you.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">Neither Bentley nor any of its employees will consider unsolicited ideas, including ideas for new advertising campaigns, new promotions, new products, or technologies, processes, materials, marketing plans, or new product names. The sole purpose of this policy is to avoid potential misunderstandings or disputes if Bentley&#39;s products or marketing strategies might seem similar to ideas or works you submitted. You agree not to send your unsolicited ideas or any original creative artwork, samples, demos, or other works to Bentley. All such unsolicited materials sent to Bentley despite the foregoing will become Bentley’s property and you agree that all intellectual property rights therein are transferred to Bentley.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"11.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: left;\">Copyright</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">Bentley respects others’ intellectual property and requests that you do too. If you believe that anything on the Services infringes your copyright or that of a third party, please<a href=\"mailto:marketing@bentley.com\" class=\"s5\" target=\"_blank\">let us know.</a></p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"12.\"><p class=\"s2\" style=\"padding-top: 3pt;padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Third-Party Content</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">The Services may contain links to third-party websites or resources. Bentley does not endorse and is not responsible or liable for the content, products, services or practices of such third-party websites or resources and does not make any representations regarding their quality, availability, or accuracy. Your use of third-party websites or resources is at your own risk and subject to the terms and conditions for such third-party websites or resources, and you are solely responsible for your use thereof. Under no circumstances will Bentley be liable for any loss or damage caused by your viewing, use or reliance on third-party websites or resources. If Bentley provides you with any software under an open-source license, there may be provisions in those licenses that expressly conflict with these Terms, in which case the open-source provisions will apply. Bentley may at any time, for any reason, modify or discontinue the availability of any third-party websites or resources via the Services.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"13.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Termination</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You may terminate these Terms at any time by discontinuing your use of the Services. Bentley reserves the right to suspend your use of the Services at any time and for any length of time, with or without cause, and with or without notice. These Terms will terminate immediately without notice from Bentley if you fail to comply with any provision of these Terms. Bentley may, but is not obligated to, provide advance notice of any suspension or termination and/or aid in the retrieval of your data. All licenses to the Client Software and Documentation granted hereunder shall automatically terminate upon termination of these Terms. Your breach of these Terms shall result in immediate termination of these Terms and the Services.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"14.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Local laws; Export Control</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You agree, regardless of any disclosure made by you to Bentley concerning the ultimate destination of the Services or materials or information obtained through the Services, that you will not export or transfer, whether directly or indirectly, the Bentley technology, materials, information and data, or any portion thereof or any direct product thereof, outside the United States without first complying strictly and fully with all export control laws or regulations that may be imposed by the U.S. Government or any country or organization of nations within whose jurisdiction you obtain access to or use the Services. The countries subject to restriction by action of the United States Government are subject to change, and it is your responsibility to comply with the United States Government requirements, as they may be amended from time to time. You assume sole responsibility for obtaining licenses or other approvals required for export or re-export as may be required. You shall indemnify, defend, and hold Bentley harmless for any breach of your obligations pursuant to this section.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">The Services are subject to the export control laws, rules, regulations, restrictions and national security controls of the United States and other agencies or authorities based outside of the United States (the “Export Controls”). Your use of the Services must always comply with Export Controls, so you must not do any of the following:</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><ol id=\"l5\"><li data-list-text=\"(a)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: left;\">Access or use the Services from within a U.S.-sanctioned location or if you appear on any U.S. government restricted parties list.</p></li><li data-list-text=\"(b)\"><p style=\"padding-top: 2pt;padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Use  the  Services  in  connection  with  a  restricted  end  use,  such  as  work  on nuclear/chemical/biological weapons or missile systems capable of delivering them, without first obtaining any required government approvals.</p></li><li data-list-text=\"(c)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Use the Services in connection with technical data that is controlled under the International Traffic in Arms Regulations (“ITAR”), any of its foreign counterparts, or any national security laws or regulations.</p></li><li data-list-text=\"(d)\"><p style=\"padding-left: 77pt;text-indent: -18pt;text-align: justify;\">Use the Services to upload or transmit any content or materials that cannot legally be exported to the United States or to disclose, transfer, download, export, or re-export, directly or indirectly, your Content, Bentley Content or any other content or material to any country, entity or other party that is ineligible to receive such items under the Export Control Laws or other applicable law or regulation.</p></li></ol><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"15.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: left;\">Services is Available “AS-IS”</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">UNLESS YOU HAVE AN ADDITIONAL AGREEMENT CURRENTLY IN PLACE WITH BENTLEY THAT IS SPECIFIC WITH RESPECT TO THE SERVICES AND GRANTS SOME LIMITED WARRANTIES, THE SERVICES AND ANY RELATED DOCUMENTATION ARE PROVIDED &quot;AS IS&quot; AND WITHOUT WARRANTY OF ANY KIND. BENTLEY EXPRESSLY DISCLAIMS ALL EXPRESS OR IMPLIED CONDITIONS, REPRESENTATIONS AND WARRANTIES, INCLUDING WITHOUT LIMITATION THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. BENTLEY MAKES NO REPRESENTATIONS, WARRANTIES, OR GUARANTIES AS TO THE USE, RESULTS, QUALITY, SUITABILITY, TRUTH, ACCURACY, COMPLETENESS OR HELPFULNESS OF ANY OF THE SERVICES, THE SOFTWARE OR RELATED DOCUMENTATION. BENTLEY MAKES NO WARRANTY OR REPRESENTATION THAT THE SERVICES, THE SOFTWARE OR RELATED DOCUMENTATION WILL MEET ANY OF YOUR REQUIREMENTS OR THAT THE OPERATION THEREOF WILL BE UNINTERRUPTED, SECURE, OR ERROR FREE. THE SERVICES ARE NOT A SUBSTITUTE FOR THE PROFESSIONAL JUDGMENT OF ENGINEERS IN THE DESIGN AND ENGINEERING OF BUILDINGS AND OTHER INFRASTRUCTURE. THE FEES FOR THE USE OF THE SERVICES AND THE SOFTWARE REFLECT THIS ALLOCATION OF RISK. FOR PURPOSES OF THIS PARAGRAPH, BENTLEY AND BENTLEY’S LICENSORS ARE COLLECTIVELY REFERRED TO AS “BENTLEY.”</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"16.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: left;\">Limitation of Liability</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">BENTLEY IS NOT LIABLE FOR ANY DAMAGES SUFFERED AS A RESULT OF USING, MODIFYING, CONTRIBUTING, COPYING, DISTRIBUTING OR DOWNLOADING THE SERVICES OR RELATED DOCUMENTATION, OR OTHER MATERIALS OR INFORMATION OBTAINED THROUGH THE SERVICES. BENTLEY IS NOT LIABLE FOR ANY INDIRECT, INCIDENTAL, PUNITIVE, SPECIAL OR CONSEQUENTIAL DAMAGES (INCLUDING LOSS OF BUSINESS, REVENUE, PROFITS, USE, DATA OR OTHER ECONOMIC ADVANTAGE) RESULTING FROM THE USE OR INABILITY TO USE THE SERVICES OR THE SOFTWARE, HOWEVER IT ARISES, WHETHER FOR BREACH OR IN TORT, EVEN IF BENTLEY HAS BEEN PREVIOUSLY ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. YOU AGREE TO HOLD BENTLEY HARMLESS FROM, AND YOU AGREE NOT TO SUE BENTLEY FOR, ANY CLAIMS ARISING FROM YOUR USE OF OR INABILITY TO USE THE SERVICES, THE SOFTWARE, RELATED DOCUMENTATION OR OTHER MATERIALS AND INFORMATION OBTAINED BY YOU THROUGH THE SERVICES.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">IN NO EVENT SHALL BENTLEY’S TOTAL LIABILITY TO YOU FOR ALL DAMAGES, LOSSES AND CAUSES OF ACTION, WHETHER IN CONTRACT, TORT (INCLUDING NEGLIGENCE) OR OTHERWISE, EXCEED THE AMOUNT PAID BY YOU FOR USE OF THE SERVICES. FOR PURPOSES OF THIS PARAGRAPH, BENTLEY AND BENTLEY’S LICENSORS ARE COLLECTIVELY REFERRED TO AS “BENTLEY.”</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">BENTLEY MAKES NO WARRANTIES TO ANY THIRD PARTY. BENTLEY DOES NOT REPRESENT OR WARRANT THAT THE SERVICES ARE OR WILL BE APPROPRIATE OR AVAILABLE FOR USE IN ANY PARTICULAR GEOGRAPHIC AREA, JURISDICTION OR LANGUAGE. THIS SECTION WILL BE ENFORCEABLE TO THE MAXIMUM EXTENT ALLOWED BY APPLICABLE LAW. NO INFORMATION OR ADVICE (WHETHER WRITTEN, ORAL OR OTHERWISE) PROVIDED BY BENTLEY OR ITS REPRESENTATIVES WILL CREATE ANY WARRANTY OR IN ANY WAY AFFECT THE DISCLAIMERS OF WARRANTIES OR LIMITATIONS OF LIABILITY EXPRESSLY PROVIDED IN THESE TERMS.</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">THE SERVICES OFFERED BY BENTLEY ARE NOT A SUBSTITUTE FOR YOUR OWN JUDGMENT (INCLUDING PROFESSIONAL JUDGMENT) OR INDEPENDENT TESTING, DESIGN, ESTIMATION OR ANALYSIS, AS APPLICABLE. DUE TO THE LARGE</p><p style=\"padding-top: 2pt;padding-left: 5pt;text-indent: 0pt;text-align: justify;\">VARIETY OF POTENTIAL APPLICATIONS FOR THE SERVICES, THE SERVICES HAVE NOT BEEN TESTED IN ALL SITUATIONS UNDER WHICH THEY MAY BE USED AND MAY NOT ACHIEVE THE RESULTS YOU DESIRE. BENTLEY WILL NOT BE LIABLE IN ANY MANNER WHATSOEVER FOR ANY RESULTS OR OUTPUT OBTAINED OR OTHERWISE VIEWED THROUGH THE SERVICES OR ANY MATERIALS DEVELOPED BY YOU IN CONNECTION WITH THE SERVICES. YOU ARE RESPONSIBLE FOR THE SUPERVISION, MANAGEMENT AND CONTROL AND USE OF THE SERVICES AND YOUR APPLICATIONS. THIS RESPONSIBILITY INCLUDES THE DETERMINATION OF APPROPRIATE USES FOR THE SERVICES AND THE SELECTION OF THE SERVICES AND OTHER PROGRAMS TO ACHIEVE YOUR INTENDED RESULTS. YOU ARE ALSO RESPONSIBLE FOR ESTABLISHING THE ADEQUACY OF INDEPENDENT PROCEDURES FOR TESTING THE RELIABILITY, ACCURACY AND COMPLETENESS OF SERVICE RESULTS, OUTPUT OR MATERIALS DEVELOPED BY YOU IN CONNECTION WITH THE SERVICES (IF ANY), INCLUDING ALL ITEMS VIEWED OR DESIGNED USING ANY SERVICE. THERE ARE NO SERVICE LEVEL AGREEMENTS MADE IN CONNECTION WITH THE SERVICES.</p><p style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">Bentley shall not be liable to you or any third party for any delay, interruption, error, or malfunction resulting from natural  disaster;  transportation  problems;  defects,  or malfeasance  of  third-party  software,  hardware, communications, or power supplies; strikes; actual or threatened war (whether or not declare d); civil unrest; riots; earthquakes; floods; fire; actual or threatened terrorist acts; acts or omissions of persons not hired, retained, or supervised by the other party; Acts of God; and other acts, events, or circumstances beyond its reasonable control , whether or not foreseeable or identified.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"17.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Indemnification</p><p class=\"s6\" style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">You agree to indemnify and hold harmless Bentley and its officers, directors, employees, agents, affiliates, third party information providers, licensors, contractors, and others involved in delivery of the Services from and against all liabilities, expenses, damages, and costs, including reasonable attorney’s fees, arising from any violation by you of these Terms or your use of the Services or information obtained therefrom.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"18.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: justify;\">Government End Users</p><p class=\"s6\" style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">The Services and Documentation are “Commercial Items” consisting of “Commercial Computer Client Software” and “Commercial Computer Client Software Documentation” as such terms are defined in the Federal Acquisition Regulations (“FAR”) at 48 CFR 2.101, developed exclusively with private funds. Consistent with 48 CFR 12.212, and the comparable DFAR in the DoD FAR Supp. at 227.7202-1 through 227.7202-4, the Services are licensed to you only as Commercial Client Software and only with the rights and obligations granted to public users generally as set forth above in these Terms. Notwithstanding any other FAR, DFAR or other contractual provision into which these Terms may be incorporated, any government end user acquires the rights to use the Services and Documentation only as set forth in these Terms. The Services and Documentation are accessed and acquired under the specific terms and conditions set forth herein. If any portion of the Services or Documentation is deemed “non-commercial,” or the following FARs or DFARs are deemed to apply, the Services and the Documentation are licensed under the terms hereof and under the RESTRICTED RIGHTS set forth in 48 CFR 52.227-19 and DFAR 252.227-7014 (and the government’s use, duplication and disclosure rights are restricted as set forth therein).</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"19.\"><p class=\"s2\" style=\"padding-left: 41pt;text-indent: -36pt;text-align: left;\">Miscellaneous Legal Terms</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><ol id=\"l6\"><li data-list-text=\"A.\"><p style=\"padding-left: 5pt;text-indent: 36pt;text-align: justify;\">Governance. If you are located outside the geographic boundaries of the United States or Canada, these Terms will be governed by and construed in accordance with the substantive laws in force in Ireland, and the courts located in Ireland shall have exclusive jurisdiction over all disputes relating to this Agreement. If you are located within the geographic boundaries of the United States or Canada, these Terms will be governed by and construed in accordance with the substantive laws in force in the Commonwealth of Pennsylvania, and the state courts located in Chester County, Pennsylvania and the federal courts located in Philadelphia, Pennsylvania shall have exclusive jurisdiction over all disputes relating to this Agreement. To the maximum extent permitted by applicable law, the parties agree that the provisions of the United Nations Convention on Contracts for the International Sale of Goods, as amended, and the provisions of the Uniform Computer Information Transactions Act, as they may have been or hereafter may be in effect in any jurisdiction, shall not apply to this Agreement.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"B.\"><p style=\"padding-left: 5pt;text-indent: 36pt;text-align: justify;\">Rights and Claims. Any cause of action you may have with respect to the Services must be commenced within one (1) year after the claim or cause of action arises or such claim or cause of action is barred.</p><p style=\"padding-top: 2pt;padding-left: 5pt;text-indent: 0pt;text-align: justify;\">These Terms create no third-party beneficiary rights. Bentley’s failure to exercise any of its rights under or to enforce any provision of these Terms will not be deemed a waiver or forfeiture of such rights or ability to enforce such provision. The provisions of these Terms shall be deemed to be separable, and the invalidity of any provision hereof shall not affect the validity of the remainder of these Terms. Neither a course of dealing or conduct between you and Bentley nor any trade practice will be deemed to modify these Terms. You may not assign any of your rights set forth in these Terms, and any such attempt is void, but Bentley may assign its rights to any of its affiliates or subsidiaries, or to any successor in interest of any business associated with the Services.</p><p style=\"text-indent: 0pt;text-align: left;\"><br/></p></li><li data-list-text=\"C.\"><p style=\"padding-left: 5pt;text-indent: 36pt;text-align: justify;\">Notices. Notices from you to Bentley will be effective when received by Bentley at Bentley Attention: General Counsel at the applicable address listed below. Notices from Bentley to you may be sent by postal service, a delivery service or email. Notices from Bentley to you will be effective: (a) in the case of notices by email, one (1) day after sending to the email address provided to Bentley; or (b) in the case of notices by mail or delivery service, five (5) days after sending by regular post or delivery service to the address provided to Bentley. Communi cation with you will often take place via an email to the contact email address registered to your Bentley account. You must ensure that your email address is current and that you do not filter out any such messages. You consent to service of process being affected on you by registered mail sent to your last address known by Bentley, if permitted by applicable law. You consent to receive communications electronically from Bentley and you agree that all agreements, notices, disclosures, and other communications that Bentley provides to you electronically satisfy any legal requirement that such communications be in writing. This condition does not affect your statutory rights. <u>If you are located within the</u> <u>geographic boundaries of the United States or Canada, please send all notices under these Terms to Bentley Systems,</u> <u>Incorporated, Attn: Legal Department, 685 Stockton Drive, Exton, PA 19341-0678, otherwise please send all notices</u> <u>to Bentley Systems International Limited Attn: Legal Department, Charlemont Exchange, 5th Floor, Charlemont Street,</u> <u>Dublin 2 Ireland</u>.</p></li></ol></li></ol><p style=\"text-indent: 0pt;text-align: left;\"><br/></p><p class=\"s6\" style=\"padding-left: 5pt;text-indent: 0pt;text-align: justify;\">YOU REPRESENT AND WARRANT TO BENTLEY THAT YOU HAVE ALL THE RIGHTS, POWER AND AUTHORITY NECESSARY TO GRANT THE LICENSES AND RIGHTS SET FORTH IN THESE TERMS.</p></body></html>\r\n"},"__N_SSG":true}