{"pageProps":{"tab":"tutorials","overview":"# iTwin for Unreal Engine\n\nBring your iTwin data into Unreal Engine using the iTwin Exporter for Datasmith application.\nWith it, you can export iModel data into the Datasmith format and import it into\nyour Unreal project.\n\nThe iTwin Exporter for Datasmith offers the following features:\n\n- Export your model's geometry and element metadata into Unreal Engine\n- Export animation data such as schedules in your iTwin as level sequences in Unreal Engine\n- Use existing iTwin saved views to filter exports by models, categories, elements\n- In advanced use cases, leverage the power of [ECSQL](https://www.itwinjs.org/learning/ecsql/) for filtering exports.\n\n<a href=\"https://autoupdatecdn.bentley.com/itwinexporterdatasmith/iTwinDatasmithExporterSetup.exe\" download>\n  <button class=\"iui-button iui-high-visibility download-button\" type=\"button\">\n    <span class=\"iui-label\">\n      Download now\n    </span>\n  </button>\n</a>\n\nDownload the iTwin Exporter for Datasmith and get started with our\n[step-by-step tutorials](/unreal/integration/tutorials).\nBe sure to check the [documentation](/unreal/integration/overview) for troubleshooting and questions.\n\n<img src=\"/unreal-docs-site/static/images/unreal-export-app-fullscreen.png\" alt=\"iTwinViewer\" title=\"iTwin Viewer\" style=\"max-width:100%;max-height:500px;\"/>\n","documentation":"# iTwin Exporter for Datasmith\n\nThe iTwin Exporter for Datasmith provides a viewer interface and\ntools to load and export iTwin data as a `.udatasmith` file and\nthe corresponding Datasmith `_Assets` directory. Use Unreal Engine's Datasmith importer plugin\nand our iTwin Datasmith plugin to import the exported datasmith content.\nThe Datasmith scene can be created with all of your geometric element metadata embedded for accessing\nat runtime in Unreal Engine and at import time when using Visual Dataprep to process the scene during import.\n\n## Table of Contents\n\n1. [iTwin Unreal Datasmith Plugin](#itwinunrealdatasmithplugin)\n    1. [Plugin compatibility](#plugincompatibility)\n1. [Animations and schedule scripts](#animationsandschedulescripts)\n    1. [Combined-mesh export animation support](#combinedmeshexportanimationsupport)\n    1. [Non-combined-mesh export animation support](#noncombinedmeshexportanimationsupport)\n1. [Performance considerations](#performanceconsiderations)\n    1. [Combined-mesh export is the default](#combinedmeshexportisthedefault)\n    1. [Non-combined-mesh export does not preserve the element hierarchy](#noncombinedmeshexportdoesnotpreservetheelementhierarchy)\n    1. [Filtering exported elements](#filteringexportedelements)\n    1. [Filtering with Visual Dataprep](#filteringwithvisualdataprep)\n1. [Materials](#materials)\n    1. [Custom materials with visibility-animated combined-mesh exports](#custommaterialswithvisibilityanimatedcombinedmeshexports)\n1. [Metadata](#metadata)\n    1. [Limitations](#limitations)\n    1. [Animation data](#animationdata)\n1. [Command line interface](#commandlineinterface)\n    1. [Using the command line interface](#usingthecommandlineinterface)\n\n## iTwin Unreal Datasmith Plugin\n\nThe iTwin Exporter for Datasmith helps you install\nthe _iTwin Unreal Datasmith Plugin_ providing C++ and Blueprint\nAPIs for controlling the animations of your iTwin. This plugin\nalso provides the default materials for your scene. See the\n[Blueprint API reference](/unreal/integration/blueprint-api-reference).\n\n### Plugin compatibility\n\nThe plugin is compatible and has been tested with Unreal Engine versions 4.26.1 through 5.0.0.\nThe plugin may successfuly recompile on older versions but there is a bug in the Datasmith importer for those versions\nthat could impact some animations.\n\n## Animations and schedule scripts\n\n### Combined-mesh export animation support\n\nIn combined-mesh exports we currently support\n\n- cutting plane (growing) animations\n- color animations (such as SYNCHRO appearance profiles)\n- visibility animations\n- transformation animations such as rotation, translation, and scaling\n  - transformation-animated (moving) objects do _not_ support color or cutting plane animations\n\nAll non-transformation animations for combined-mesh scenes are performed by special dynamic materials applied to your meshes by the\n[ScheduledActor](/unreal/integration/blueprint-api-reference/#AScheduledActor) class from the iTwin Unreal Datasmith Plugin, which exposes a [Blueprint and C++ API](/unreal/integration/blueprint-api-reference) for managing\nthe animation state. All transformation-animated objects are exported as separated objects and animated using an Unreal\nwhich you must add to the scene and manually manage due to limitations in the Datasmith API.\nConsult Unreal Engine's [Sequencer Overview](https://docs.unrealengine.com/AnimatingObjects/Sequencer/Overview/)\nfor more information on level sequences.\n\n### Non-combined-mesh export animation support\n\nWe do not currently support cutting plane (growing) animations or color animations in\nnon-combined mesh exports due to limitations in the Datasmith API. Visibility and transform animations are supported.\n\nAn Unreal Level Sequence provides animations for non-combined mesh scenes. You must add a level sequence actor to the scene yourself\nand control it using Unreal's sequencer.\nConsult Unreal Engine's [Sequencer Overview](https://docs.unrealengine.com/AnimatingObjects/Sequencer/Overview/)\nfor more information on level sequences.\n\nYou may notice useless visibility tracks on some static meshes, this is an issue in Datasmith, and we are working closely\nwith Epic to resolve it.\n\n## Performance considerations\n\nConsider the following when trying to improve the performance of your scene.\nBut always be aware that hardware is often a significant bottleneck when performing intense graphical work, such as working with scenes in Unreal Engine.\n\n### Combined-mesh export is the default\n\nMany scenes are too large to handle directly in Unreal without manually processing them. As such, we\nrecommend using the \"combined meshes\" feature during export. Combined-mesh exports combines all of the geometry in\nyour scene into one static mesh. You can then apply high-fidelity materials to your material slots; see the [Materials](#Materials) section\nfor limitations.\n\nIf you have an extremely high amount of instanced geometry or pieces of your geometry are too distant to be visible together, you may benefit from performing a separate or non-combined mesh export. Non-combined mesh export enables frustum culling of separate objects in the scene\nwhich generally increases performance in those cases, and makes it easier to edit your objects in Unreal.\n\n### Non-combined-mesh export does not preserve the element hierarchy\n\niModels meticulously split geometry into a sprawling hierarchy of elements. While this is great for your data and its organization,\ntranslating them into Unreal actors can be much less performant than collapsing the hierarchy. As such, the hierarchy of elements in your iModel\nis not preserved since it would require a lot of empty actors; it is instead flattened into a list of geometry-containing elements.\nThis ensures speedier imports and the best runtime performance possible, even when using a non-combined-mesh export.\n\nTo use the hierarchy information when writing your own Visual Dataprep recipes,\nevery mesh element of the actor scene has a metadata property `ElementPathByLabel`,\na forward-slash delimited string of User Labels (or Ids) of parent elements and models to reach your element in the scene.\nFor instance, `/0x1/0x20000000003/Site.dwfx/Walls (13)/Basic Wall (13)/Site Perimeter Fence (13)/Basic Wall [613789]`.\n\n### Filtering exported elements\n\nHide elements, models, and categories in the viewport using the element tree on the right or, once an element is selected,\nwith the visibility tools in the top-left horizontal toolbar. Once you've hidden the objects you want to filter, use the \"Export Current View\"\ntool in the top-left horizontal toolbar to export and filter those elements.\n\nUse the **Saved-Views Widget** to save your viewport state if you want to re-export the scene again with these parts hidden.\nUse advanced export to write [ECSQL](https://www.itwinjs.org/learning/ecsql/) queries to customize which elements are\nfiltered using custom logic such as geometric queries.\n\n### Filtering with Visual Dataprep\n\nAnother technique for getting more performance out of your iModel geometry in Unreal is using Datasmith's Visual Dataprep to process your scene.\nUse Dataprep recipes to filter out obscured and unnecessary actors and to optimize geometry with Datasmith's support for the [proxy geometry tool](https://docs.unrealengine.com/TestingAndOptimization/ProxyGeoTool/).\n\nReducing your actor count, getting rid of any unnecessary geometry, and optimizing unnecessarily dense geometry will all help lower the runtime costs of your scene.\n\n## Materials\n\nIn the combined-mesh export, differently colored or textured parts of your iModel will be split into different material slots; geometry with\nthe same underlying color but different textures in the\nAll meshes, combined or not, store the original color of underlying graphics in the corresponding mesh vertices for use in materials.\n\nIf dividing material slots further would improve your workflow, either by category and model or by using ECSQL,\nplease vote for that feature on our [ideas portal](https://itwinplatform.ideas.aha.io/?category=7010781758179112615).\n\n### Custom materials with visibility-animated combined-mesh exports\n\nMaterials need to opt-in to the visibility animation if controlled by the [ScheduledActor](/unreal/integration/blueprint-api-reference#AScheduledActor). To do so:\n\n1. In the lower right corner of the **Content Browser**, press **View Options**, and mark the **Show Plugin Content** checkbox.\n\n   <img alt='in the bottom right of the Content Browser open View Options and make sure \"Show Plugin Content\" is checked'\n        src=\"/unreal-docs-site/static/images/unreal-export-show-plugin-content.png\" style=\"max-width:100%;max-height:350px\">\n\n1. Open the the offending material in the material editor, set its blend mode to \"Masked\" (or if it's transparent, keep it).\n\n   <img alt=\"material details Blend Mode\"\n        src=\"/unreal-docs-site/static/images/unreal-export-set-material-blend-mode.png\"\n        style=\"max-width:100%;max-height:350px\">\n\n1. Add a material function node, set it to use the iTwin Datasmith Importer Plugin's `MF_SynchroVisibilityAnimate` material function,\n   and connect it to your material's opacity. You may want to blend (e.g. with a multiply node) the visibility animation's opacity with any\n   other opacity your material is already using.\n\n## Metadata\n\nThere are multiple options for exporting metadata. Due to how metadata is attached in Unreal Engine, metadata is only\navailable when not using the \"combine meshes\" option. The default metadata export setting is \"element metadata\", which includes data\ndirectly attached to the exported geometric elements.\n\n### Limitations\n\nThe \"all metadata\" option will bring in all data corresponding to all exported elements from the iModel, but can be significantly slower than\nthe default option. In all cases, because only geometric elements are exported, the metadata of other elements in the hierarchy is\nnot brought into Unreal.\n\n### Animation data\n\nThe `ScheduledActor` and the `SceneMetaData` actor when exporting will contain a metadata entry `ScheduleScript`, which will contain the entire scene's\nanimation data in a JSON format which comes from the iTwin.js\n[RenderSchedule.Script](https://www.itwinjs.org/reference/core-common/displaystyles/renderschedule/renderschedule.script/).\n\nThe `ScheduledActor` actually parses and uses this at runtime to perform the combined-scene animation, and that code ships with the plugin\nand is therefore freely available to view and extend in your own projects.\n\n## Command line interface\n\nThe iTwin Exporter for Datasmith application comes with a command line interface, sometimes called the CLI. This can be useful in advanced\nautomation cases. With it, you can run an export without opening the graphical user-interface of the application at all, as well as any\namount of filtered exports in a row without any user interaction.\n\n### Using the command line interface\n\nBecause the iTwin Exporter for Datasmith is only available for the Windows operating system, we recommend using\n[PowerShell](https://docs.microsoft.com/en-us/powershell/scripting/overview?view=powershell-7.2) to use the command line interface of programs\nsuch as the iTwin Exporter for Datasmith.\n\nYou must first find the application's executable file, it is typically installed at\n`C:\\Users\\<YOUR_USER_NAME>\\AppData\\Local\\iTwinDatasmithExporter\\app-<YOUR_APP_VERSION>\\iTwinDatasmithExporter.exe`.\n\nOpen a terminal with a shell, such as PowerShell, or Command Prompt, both of which come with modern Windows, and try the following command.\nBe sure to replace the executable path containing `<YOUR_USER_NAME>` and `<YOUR_APP_VERSION>` with the complete path you find on your local computer.\n\n```pswh\nC:\\Users\\<YOUR_USER_NAME>\\AppData\\Local\\iTwinDatasmithExporter\\app-<YOUR_APP_VERSION>\\iTwinDatasmithExporter.exe export --help\n```\n\nThe `--help` command will list all currently available options and their defaults.\nIf you do not use the `export` keyword as the first argument after the executable path, the graphical-user interface will be launched instead.\n\nFollowing is a sample usage of the CLI to export an online model as a combined mesh scene with a z offset of 200 (and x and y are the default offset to the\ncenter of the unreal space), all filtered by a saved view named \"My Saved View\".\n\n```pswh\nC:\\Users\\<YOUR_USER_NAME>\\AppData\\Local\\iTwinDatasmithExporter\\app-<YOUR_APP_VERSION>\\iTwinDatasmithExporter.exe export `\n  --iTwinId b3416222-bf0f-4009-92c9-25bed16a2cc\" `\n  --iModelId 64b4a1e5-2f7e-4e8e-942d-314bdc274aa5 `\n  --savedViewName \"My Saved View\" `\n  --combineMeshes `\n  -z 200 `\n  --destination D:\\Somewhere\\On\\Disk\\my-model.udatasmith\n```\n"},"__N_SSG":true}